doc/html/handlers/state.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>State Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="State Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:09 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">State Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 State Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> State Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
  The State handler controls how the <code>wf:state</code> functions store and retrieve
  page-state variables.  State variables are defined as being page-load
  specific. That is, a loading or reloading a page should result in an empty
  page state. Page state, however, is retained with postbacks, comet processes,
  and other asynchronous requests.
</p>
<p>
  Bear in mind that the state is not a <b>secure</b> store. That is, page-state gets
  pickled and sent to the client, so anything that needs to be hidden from the
  client is not recommended to be stored in the state.
</p>
<p> 
  The default implementation of the page-state is as a simple Erlang proplist.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the state handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-5">
<h5 id="sec-1-1-3"><span class="section-number-5"></span> <code>get_state(Key, DefaultValue, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-3">


<p>  
  Retrieves the current value of the state variable with the identifier <code>Key</code>
</p>
<ul>
<li><code>Key</code> - The identifier to search for

</li>
<li><code>DefaultValue</code> - If <code>Key</code> is not found, return this value instead.

</li>
<li><i>Return Value</i> - The found value associated with <code>Key</code> (or <code>DefaultValue</code>)
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-5">
<h5 id="sec-1-1-4"><span class="section-number-5"></span> <code>set_state(Key, Value, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-4">


<p>
  Stores <code>Value</code> in the page state with the identifier <code>Key</code>
</p>
<ul>
<li><code>Key</code> - The identifer to store

</li>
<li><code>Value</code> - The value to store

</li>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-5" class="outline-5">
<h5 id="sec-1-1-5"><span class="section-number-5"></span> <code>clear(Key, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-5">


<p>
  Clears the page state value associated with <code>Key</code>
</p>
<ul>
<li><code>Key</code> - The identifier to delete from the page state

</li>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-6" class="outline-5">
<h5 id="sec-1-1-6"><span class="section-number-5"></span> <code>clear_all(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-6">


<p>
  Wipes out all page state variables.
</p>
<ul>
<li><i>Return Value</i> - {ok, NewState}
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Here is the complete text of the default state handler
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (default_state_handler).
<span class="org-preprocessor">-behaviour</span> (state_handler).
<span class="org-preprocessor">-include_lib</span> (<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>, <span class="org-type">finish/2</span>, <span class="org-type">get_state/4</span>, <span class="org-type">set_state/4</span>, <span class="org-type">clear/3</span>, <span class="org-type">clear_all/2</span>
]).

<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Deserialize the state from domState.</span>
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">get_state</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">DefaultValue</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">_Value</span> = <span class="org-type">proplists</span>:<span class="org-type">get_value</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">State</span>, <span class="org-variable-name">DefaultValue</span>).

<span class="org-function-name">set_state</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">State1</span> = <span class="org-type">proplists</span>:<span class="org-type">delete</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">State</span>),
    <span class="org-variable-name">State2</span> = [{<span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span>}|<span class="org-variable-name">State1</span>],
    {ok, <span class="org-variable-name">State2</span>}.

<span class="org-function-name">clear</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">State1</span> = <span class="org-type">proplists</span>:<span class="org-type">delete</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">State</span>),
    {ok, <span class="org-variable-name">State1</span>}.

<span class="org-function-name">clear_all</span>(<span class="org-variable-name">Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-type">init</span>(<span class="org-variable-name">Config</span>, []).
~
</pre>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../api.html#sec-8">API: State</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:09 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/state.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
